import { useParams } from 'react-router-dom';
import Header from "../Header/Header";
import Aside from "../common/Aside/Aside";
import { useEffect, useState } from 'react';
import cities from '../Db';
import "./OfferDetails.css";

const OfferDetails = () => {
  const { id } = useParams();
  const [ cityDetails, setCityDetails] = useState({});

  useEffect(() => {
   setCityDetails({...cities.filter((x) => x.name == id)[0]});
   window.scrollTo(0,0);
  }, [ id ]);

  return (
    <main className="offer-details-main">
      <Header />
      <section className="offer-section">
        <article className="offer-img-article">
          <img src={cityDetails.img} alt={cityDetails.name} />
        </article>
        <article className="offer-main-content">
          <section className="offer-description-section">
            <div className="offer-description">
              <h3 className="offer-city-heading">{cityDetails.name}</h3>
              <p>
                Модната столица на света - Милано - ви очаква, за да ви очарова
                с шикозните си кафенета, коктейлите с Кампари, изкуството и
                историята скрити зад всеки ъгъл. Италия - вашата дестинация с
                аромат на любов и еспресо! История, първокласен шик, коледни
                базари и пазаруване в дизайнерски аутети на световно -
                известните марки Gio Armani, Robeto Cavalli, D&G, Calvin Klein,
                Escada, Diesel, Lacoste, Patrizia Pepe,Guess и др!
              </p>
            </div>
            <div>
              <p>ПРОГРАМА: 4 ДНИ / 3 НОЩУВКИ</p>
              <p>1 ДЕН София – Бергамо/ Милано</p>
              <p>
                04:40 ч. среща на летище София Терминал 1 на гишето за Милано.
                06:35ч. Отпътуване от летище София с полет на Wizz Air. 07:45 ч.
                пристигане на л-ще Бергамо до Милано. Трансфер летище Бергамо –
                до хотела в Милано и оставяне на багажа. (Настаняване след
                14ч.). 10 ч. Пешеходна разходка в историческия център на Милано
                /с метро /: започва с посещение на средновековната крепост
                „Сфорца”, продължаваме по виа „Данте“ с паметника на Гарибалди
                към Площада и Катедралата Дуомо една от най-забележителните в
                Европа, характерна със своята “пламтяща готика”. Фото- пауза
                пред внушителния монумент на краля- обединител. Ще прекосим
                Покритата галерие Виктор Емануел II, към Паметника на Леонардо
                да Винчи и операта “Ла Скала” /отвън/. Свободно време за шопинг
                по световно извесна улица на модата Монтенаполеоне . Връщане в
                хотела и настаняване.
              </p>
              <p>
                2 ДЕН Милано – Лугано /Швейцария /- Комо и едноименното езеро
              </p>
              <p>
                Закуска. По желание, с допълнително заплащане:* 09 ч.
                Едноднодневна екскурзия пленителния град ЛУГАНО и курорта Комо.
                Пристигане в Лугано – най-южния град на Швейцария/кантон Тичино,
                живописно разположен на брега на езерото Лугано. Разходката ни
                започва от парка на вила „Чини“, и фото-пауза на „Вратата на
                езерото“ продължава към пиаца делла Риформа, където се издига
                ренесансовата сграда на кметството и най-старата банка и
                завършва на зеления парк и крайбрежната алея, известена с
                красивите цветя, италиански дворци и Църквата Св.Мария на
                Ангелите с изключителните фрески на Бернардино Луини . Свободно
                време по търговската ул. Наса. Отпътуване за езерото Комо.
                Разглеждане на главния град на езерото Комо – „Пиаца дел Дуомо”,
                катедралата „Санта Мария Маджоре”, кметството. Възможност* за
                изкачване с фуникуляр* до Брунате, откъдето се открива прекрасна
                гледка към езерото, и където се намират вила „Белависта”, в
                която е починал Пенчо Славейков, църквата, в която е било опято
                тялото на поета и гробището, където е бил погребан, преди
                тленните му останки да бъдат пренесени в България - осем години
                след смъртта му или Свободно време за обяд и разходка по
                езерото. Връщане в Милано. Нощувка.
              </p>
              <p>3 ДЕН Eзерото МАДЖОРЕ – Стреза- Боромелови острови</p>
              <p>
                Закуска. Свободно време в Милано или По желание Eднодневна
                екскурзия до езерото Маджоре и Стреза *08:30 ч. Отпътуване за
                Стреза (95 км ) – перлата на Лаго Маджоре, градче, разположено
                на брега на езерото, в което Ърнест Хемингуей написва известния
                си роман “Сбогом на оръжията”. По желание, с допълнително
                залащане - разходка с лодка до 3-те Боромеови острова. Посещение
                на Ренесансовата вила на семейство Боромео и на красивата
                ботаническа градина в английски стил, разположени на Изола
                Мадре. Разходка сред чудните цветни градини, разположени
                терасовидно към езерото на Изола Белла и посещение на
                италианския бароков дворец, където през 1935 г. се провежда
                конференцията Стреза. и Изола деи Пескатори - живописно рибарско
                селище, След 15 ч. – разходка в Стреза по крайбрежната алея с
                изглад към Алпите. Връщане в хотела. Нощувка.
              </p>
              <p>4 ДЕН – Милано - Бергамо - София</p>
              <p>
                Закуска. 09:30ч. Свободно време в Милано по интереси – за музеи
                или шопинг. В 11.30 ч. Трансфер хотел – летище. В 14:30 ч.
                излитане за София с полет на Ryan Air. В 17:25 ч. пристигане в
                София T2.
              </p>
            </div>
          </section>
          <Aside className="aside" />
        </article>
      </section>
    </main>
  );
};

export default OfferDetails;
